I think this bug is likely related to the issue I ran into today.

I created edge hostname resources referencing an old certificate which was not to be used for this edge hostname. We don't manage the certifiicates in terraform for now.

When updating the edge hostname resource, I got this during plan:

```
-/+ resource "akamai_edge_hostname" "XXXX" {
      ~ certificate   = <old> -> <new> # forces replacement
      ~ contract      = "XXXXXX" -> (known after apply)
      ~ group         = "XXXXXX" -> (known after apply)
      ~ id            = "XXXXXXX" -> (known after apply)
      ~ product       = "prd_Site_Accel" -> (known after apply)
        # (5 unchanged attributes hidden)
    }
```
    
    then during apply:

```
akamai_edge_hostname.XXXXXX: Destroying... [id=XXXXXX]
akamai_edge_hostname.XXXXXX-no: Destruction complete after 0s
akamai_property_activation.XXXXXXX: Modifying... [id=XXXXXX:PRODUCTION]
akamai_edge_hostname.XXXXXXX: Creating...
akamai_edge_hostname.XXXXXXX: Creation complete after 2s [id=XXXXXX]
```

I see that the edge hostname is still using the old certificate.

